In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel("Datos.xlsx",index_col="Nombre")

In [4]:
df.head()

            X1  X2  Y
Nombre
Luis       400  20  0
Francisco  450  35  0
Maria      500  25  0
Alvaro     600  15  0
Soledad    600  30  0

In [7]:
# media de las columnas x1,x2
X1_media= df["X1"].mean()
X2_media= df["X2"].mean()

In [8]:
# maximos de las columnas x1,x2
X1_max= df["X1"].max()
X2_max= df["X2"].max()

In [10]:
df["X1_cat"] = pd.cut(df["X1"], bins=[0,X1_media,X1_max],labels=["Pobre","Rico"])

In [12]:
df["X2_cat"] = pd.cut(df["X2"], bins=[0,X2_media,X2_max],labels=["Joven","Viejo"])

In [13]:
df.head()

            X1  X2  Y X1_cat X2_cat
Nombre
Luis       400  20  0  Pobre  Joven
Francisco  450  35  0  Pobre  Joven
Maria      500  25  0  Pobre  Joven
Alvaro     600  15  0  Pobre  Joven
Soledad    600  30  0  Pobre  Joven

In [14]:
from sklearn.naive_bayes import BernoulliNB